
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/Fumi-Mura/infra_portfolio/actions/runs/12580378046)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_1.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-fumis-portfolio-test-s3-bucket-1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "dev-fumis-portfolio-test-s3-bucket-1"
        }
      + tags_all                    = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "Name"               = "dev-fumis-portfolio-test-s3-bucket-1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_1.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_1.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = "dev-fumis-portfolio-test-s3-bucket-1"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3_1.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.s3_1.aws_s3_bucket.this: Creating...
module.s3_1.aws_s3_bucket.this: Creation complete after 4s [id=dev-fumis-portfolio-test-s3-bucket-1]
module.s3_1.aws_s3_bucket_public_access_block.this: Creating...
module.s3_1.aws_s3_bucket_versioning.this: Creating...
module.s3_1.aws_s3_bucket_server_side_encryption_configuration.this: Creating...
module.s3_1.aws_s3_bucket_public_access_block.this: Creation complete after 1s [id=dev-fumis-portfolio-test-s3-bucket-1]
module.s3_1.aws_s3_bucket_server_side_encryption_configuration.this: Creation complete after 2s [id=dev-fumis-portfolio-test-s3-bucket-1]
module.s3_1.aws_s3_bucket_versioning.this: Creation complete after 3s [id=dev-fumis-portfolio-test-s3-bucket-1]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":14,"Program":"tfcmt","SHA1":"08c6659dc96a0d0d77b0c86565b39f48b5324918","Target":"dev","Vars":{},"WorkflowName":"Apply"} -->